[
  {
    "title": "The Reset Advantage",
    "date": "October 9, 2025",
    "content": [
      "Momentum is powerful. But it can also make us blind.",
      "When things move fast, we often confuse motion with progress. We keep pushing, not because it’s working, but because stopping feels like failure.",
      "The truth is, the smartest players know when to hit reset.",
      "In rugby, a reset scrum isn’t a setback. It’s a recalibration. You tighten the formation, re-establish balance, and go again — stronger, clearer, more aligned.",
      "Business and life work the same way.",
      "A reset isn’t about losing ground. It’s about regaining clarity. It’s the moment you stop reacting and start responding again. It’s the pause that turns pressure into perspective.",
      "The advantage comes from what you see during that pause: the misalignment, the noise, the habits that stopped serving you. Most people rush past that insight. The ones who don’t, grow faster when the game resumes.",
      "So if you feel off-balance right now, don’t force momentum. Step back. Re-centre. Reset.",
      "Sometimes the most strategic move isn’t acceleration. It’s alignment."
    ]
  },
  {
    "title": "The Slipstream Principle",
    "date": "July 14, 2025",
    "content": [
      "A slipstream is a region of lower pressure that forms behind a moving object. By riding in the slipstream, cyclists or cars reduce drag and increase speed.",
      "Find a lead rider. Offer value. Learn fast. Share the load. Rotate when your cadence drops and let them take the front again.",
      "This isn’t a free ride — you still have to hold the pace — but it’s the most efficient way to grow without burning out."
    ]
  },
  {
    "title": "The Art of Becoming",
    "date": "July 10, 2025",
    "content": [
      "Wabi-Sabi: beauty in imperfection.",
      "Growth doesn’t come from chasing perfect. It comes from showing up, attempting, iterating, and allowing the work to shape you.",
      "Become the kind of person who can carry the work with humility, courage, and consistency."
    ]
  }
]

