[
  {
    "title": "The Slipstream Principle",
    "date": "July 14, 2025",
    "content": [
      "\"A slipstream is a region of lower pressure that forms behind a moving object, like a car, aircraft, or even cyclist.\" By riding in the slipstream, cyclists or cars can reduce the force of aerodynamic drag, making it easier to move and potentially increasing speed.",
      "Having been living a life of sport for as long as I can remember it has been the guiding light for me when it comes to dealing with life and its challenges. Over the years I have had to deal with many challenges in sport and in life. Through sport I’ve had the opportunity to deal with great success and massive failure and all within a short time frame, one day you can be up in the clouds and a few days later down in the gutters. I’ve had to learn how to deal with these massive emotional and mental rollercoasters on a frequent basis. Again, it was within sport that I found many of my answers and developed principles that guided me.",
      "We all have dreams and aspirations, if not, we wouldn’t be able to get ourselves out of bed in the morning. The thing with dreams is, they rarely fall into your lap. It takes extreme discipline and perseverance to chase your dreams. So, what happens when you have been doing the work, putting in the hours, operating under enormous amounts of pressure and yet you still no closer to reaching your goal? We end up losing hope, our drive starts diminishing and our cadence declines. Why does this happen? One major reason is because we have been the \"lead rider\" in a solo race trying to do it all ourselves without even realising it. It was through experiencing rollercoasters like this that I unconsciously found myself applying what I now refer to as the \"Slipstream Principle\" in all areas of my life.",
      "Let me explain how it works.",
      "1. Find someone who resembles who you want to be or has the career you want to have or the body you wish to have - you get the point.",
      "2. Think of a way you can assist them in achieving what they want.",
      "3. Convince them to allow you to help them.",
      "4. Let them take charge and guide you (let them be \"lead rider\")",
      "5. Learn as much as you can as fast as you can (Ride the slipstream)",
      "By applying these principles, you relieve enormous amounts of pressure from yourself. You mitigate unnecessary costly errors (there will always be errors) and you are forced to operate at a higher cadence, only this time having to exert less energy. Your \"lead rider\" will be absorbing most of the drag for you and you will likely get valuable exercise in taking the lead by relieving your \"lead rider\" from time to time, only this time when your cadence starts to drop your \"lead rider\" will be there to take the lead and push the pace once again. Using this principle with the consent and co-operation of your fellow rider/partner is a sure way of strengthening your resolve, increasing your endurance and getting both of you to your objectives much quicker. Make no mistake, this is not a free ride. To stay in the slipstream, you will need to keep up with the pace and stay close enough, because if the gap gets too big you will be left fighting the drag and surely be left behind.",
      "So, ask yourself this question, are you currently a \"lead rider\" or do you need to slide into a slipstream?"
    ]
  },
  {
    "title": "The Art of Becoming",
    "date": "July 7, 2025",
    "content": [
      "For many years I wanted to be something. I wanted to be someone. I wanted to reach a level where I could sit comfortably with the elite and not feel like I snuck in through the back door.",
      "That hunger and obsession to be something can drive you to put in the work, to dedicate yourself, and to climb your way up. But it can also leave you chasing an illusion. One that moves the goalpost every time you get close.",
      "Over the years I’ve had moments where I achieved things I only dreamed of. I’ve also had seasons where it felt like everything was crumbling. What I’ve learned through all of it is this: becoming is more important than arriving.",
      "Becoming requires growth, introspection, adaptability, and honesty. It requires you to ask, not just what do I want to be — but who am I willing to become to sustain it?",
      "The process of becoming stretches you in ways that the destination never will. Because once you arrive, the work doesn’t stop. If anything, it just gets more complex.",
      "So I no longer just chase titles or achievements. I chase becoming the kind of man who can carry them with humility, courage, and consistency. That, to me, is the real work. And it’s a lifelong journey."
    ]
  }
]

